ДипломнаяБаза/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ДипломнаяБаза/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскаяПлата</name>
  </enumValues>
</mdclass:Enum>

ДипломнаяБаза/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДипломнаяБаза/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ЧасоваяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ДипломнаяБаза/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
Функция ВыполнитьСозданиеДокументовРеализация(НачалоПериода, КонецПериода) Экспорт
	
	ЗапросДоговоровССозданнымиРеализациями = Новый Запрос;
	
	ЗапросДоговоровССозданнымиРеализациями.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Договор
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата >= &НачалоПериода
	|	И РеализацияТоваровУслуг.Дата <= &КонецПериода
	|	И РеализацияТоваровУслуг.ПометкаУдаления = &ПометкаУдаления";
	
	ЗапросДоговоровССозданнымиРеализациями.УстановитьПараметр("НачалоПериода", НачалоПериода);
	ЗапросДоговоровССозданнымиРеализациями.УстановитьПараметр("КонецПериода", КонецПериода);
	ЗапросДоговоровССозданнымиРеализациями.УстановитьПараметр("ПометкаУдаления", ЛОЖЬ);
		
	МассивДоговоровССозданнымиРеализациями = ЗапросДоговоровССозданнымиРеализациями.Выполнить().Выгрузить().ВыгрузитьКолонку("Договор");	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Договоры,
	               |	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	               |	ДоговорыКонтрагентов.Организация КАК Организация
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	               |	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора < &КонецПериода
	               |	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора > &НачалоПериода
	               |	И НЕ ДоговорыКонтрагентов.Ссылка В (&МассивДоговоровССозданнымиРеализациями)
	               |	И ДоговорыКонтрагентов.ПометкаУдаления = &ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата);
	Запрос.УстановитьПараметр("МассивДоговоровССозданнымиРеализациями", МассивДоговоровССозданнымиРеализациями);
	Запрос.УстановитьПараметр("ПометкаУдаления", ЛОЖЬ);
		
	ТЗРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	КоличествоДокументовДляСоздания = ТзРезультатЗапроса.Количество();

	МассивСозданныхДокументов = Новый Массив;	
	
		Сч = 1;
				
		Для каждого Договор Из ТЗРезультатЗапроса Цикл
		
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Заполнить(Договор.Договоры);
			НовыйДокумент.Договор = Договор.Договоры;    	 //указать договор
			НовыйДокумент.Дата = НачалоПериода;
			НовыйДокумент.СуммаДокумента = 1;
			НовыйДокумент.Контрагент = Договор.Контрагент;   //указать контрагента из договора
			НовыйДокумент.Организация = Договор.Организация; //указать организацию из договора
			Если НовыйДокумент.ПроверитьЗаполнение() Тогда
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись,);
				СсылкаНаСозданнуюРеализацию = НовыйДокумент.Ссылка;
				ДокументОбъект = СсылкаНаСозданнуюРеализацию.ПолучитьОбъект();
				ДокументОбъект.ВыполнитьАвтозаполнение();
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись,);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение,);
			НовыйДокументРеализация = Новый Структура;
			НовыйДокументРеализация.Вставить("Договор", Договор.Договоры);
			НовыйДокументРеализация.Вставить("РеализацияТоваровИУслуг", СсылкаНаСозданнуюРеализацию);
			МассивСозданныхДокументов.Добавить(НовыйДокументРеализация);
			Иначе 
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтрШаблон("Не удалось записать документ по договору %1. Произошла ошибка при заполнении обязательных данных.", Договор.Договоры);
				Сообщение.Сообщить();

			Продолжить;
				
			КонецЕсли;
			
			Сч = Сч + 1;
						
			ДлительныеОперации.СообщитьПрогресс(((Сч-1)/КоличествоДокументовДляСоздания)*100);
		
		КонецЦикла;
		
		Возврат МассивСозданныхДокументов;
	
КонецФункции
